NN_files/dummy_case_mesh_coordinates/constant/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "constant";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
3780
(
(0.402185 0.0321683 9.57597e-19)
(0.427646 0.0321854 4.86699e-20)
(0.454622 0.0322015 -9.24789e-21)
(0.483206 0.0322165 3.82003e-19)
(0.513491 0.0322307 -7.55648e-19)
(0.545579 0.0322439 3.85113e-19)
(0.579579 0.0322564 9.17202e-20)
(0.615602 0.032268 -1.18337e-18)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 6((0.3897 7.15421 0) (0.3897 7.20061 0) (0.3897 7.24874 0) (0.3897 7.29865 0) (0.3897 7.35041 0) (0.3897 7.4041 0));
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 2((21.1599 7.35643 0) (21.1599 7.40643 0));
    }
    hopper_outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
40
(
(0.401829 0 4.05226e-19)
(0.42657 0 0)
(0.452784 0 0)
(0.480558 0 -5.41296e-19)
(0.509986 0 4.19034e-19)
(0.541165 0 0)
(0.5742 0 0)
(0.609202 0 -5.89848e-19)
...
)
;
    }
    Wall
    {
        type            calculated;
        value           nonuniform List<vector> 
129
(
(0.3897 0.0318621 0)
(0.3897 0.0976585 0)
(0.3897 0.167734 0)
(0.3897 0.242368 0)
(0.3897 0.321856 0)
(0.3897 0.406514 0)
(0.3897 0.496678 0)
(0.3897 0.592707 0)
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<vector> 
53
(
(2.19883 0.0321065 3.14856e-18)
(2.30334 0.0979232 0)
(2.41465 0.168021 0)
(2.5332 0.242678 0)
(2.65946 0.322191 -2.82042e-19)
(2.79394 0.406875 0)
(2.93716 0.497068 2.66646e-18)
(3.08969 0.593127 5.76636e-18)
...
)
;
    }
    top
    {
        type            symmetryPlane;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
