NN_files/dummy_case_mesh_coordinates/constant/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "constant";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
3780
(
0.402185
0.427646
0.454622
0.483206
0.513491
0.545579
0.579579
0.615602
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 6(0.3897 0.3897 0.3897 0.3897 0.3897 0.3897);
    }
    outlet
    {
        type            calculated;
        value           uniform 21.1599;
    }
    hopper_outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0.401829
0.42657
0.452784
0.480558
0.509986
0.541165
0.5742
0.609202
...
)
;
    }
    Wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
129
(
0.3897
0.3897
0.3897
0.3897
0.3897
0.3897
0.3897
0.3897
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
53
(
2.19883
2.30334
2.41465
2.5332
2.65946
2.79394
2.93716
3.08969
...
)
;
    }
    top
    {
        type            symmetryPlane;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
