NN_files/dummy_case_mesh_coordinates/constant/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "constant";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
3780
(
0.0321683
0.0321854
0.0322015
0.0322165
0.0322307
0.0322439
0.0322564
0.032268
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 6(7.15421 7.20061 7.24874 7.29865 7.35041 7.4041);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 2(7.35643 7.40643);
    }
    hopper_outlet
    {
        type            calculated;
        value           uniform 0;
    }
    Wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
129
(
0.0318621
0.0976585
0.167734
0.242368
0.321856
0.406514
0.496678
0.592707
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
53
(
0.0321065
0.0979232
0.168021
0.242678
0.322191
0.406875
0.497068
0.593127
...
)
;
    }
    top
    {
        type            symmetryPlane;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
