NN_files/dummy_case_mesh_coordinates/constant/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "constant";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
3780
(
9.57597e-19
4.86699e-20
-9.24789e-21
3.82003e-19
-7.55648e-19
3.85113e-19
9.17202e-20
-1.18337e-18
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    hopper_outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
4.05226e-19
0
0
-5.41296e-19
4.19034e-19
0
0
-5.89848e-19
...
)
;
    }
    Wall
    {
        type            calculated;
        value           uniform 0;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
53
(
3.14856e-18
0
0
0
-2.82042e-19
0
2.66646e-18
5.76636e-18
...
)
;
    }
    top
    {
        type            symmetryPlane;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
