NN_files/dummy_case_mesh_coordinates/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (sludge water);

sludge
{
    transportModel plastic;

    "(plastic)Coeffs"
    {
        coeff    1;    // viscosity almost like water at alpha = 0
        exponent 0.0011;         // from fitting to bokil model data
        muMax    0.2;
    }
    rho         1450;
}

water
{
    transportModel  Newtonian;

    nu              1e-06;
    rho             998;
}

relativeVelocityModel simple;

"(simple|general)Coeffs"
{
    V0              (0 -0.00471 0); // ~13.8923 m/h from model fitting.
    a               165.8712;
    a1              0;
    residualAlpha   0;
}


// ************************************************************************* //
