NN_files/dummy_case_mesh_coordinates/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
3780
(
(0.539857 0.0447523 0)
(0.56065 0.0447673 2.36858e-20)
(0.582682 0.0447821 -7.4258e-19)
(0.606026 0.0447965 2.05496e-18)
(0.63076 0.0448107 1.25894e-18)
(0.656966 0.0448245 5.38712e-19)
(0.684733 0.044838 7.23936e-19)
(0.714153 0.0448512 -2.57974e-18)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 6((0.5297 6.39045 0) (0.5297 6.43685 0) (0.5297 6.48498 0) (0.5297 6.53489 0) (0.5297 6.58665 0) (0.5297 6.64034 0));
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 2((18.3423 6.59267 0) (18.3423 6.64267 0));
    }
    hopper_outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
40
(
(0.539568 0 0)
(0.559774 0 -7.09381e-20)
(0.581184 0 -7.09105e-20)
(0.603867 0 -9.18016e-19)
(0.627901 0 -7.0857e-20)
(0.653366 0 0)
(0.680346 0 6.14261e-19)
(0.708932 0 7.07809e-20)
...
)
;
    }
    Wall
    {
        type            calculated;
        value           nonuniform List<vector> 
129
(
(0.5297 0.0443312 0)
(0.5297 0.135877 0)
(0.5297 0.233377 0)
(0.5297 0.337218 0)
(0.5297 0.447814 0)
(0.5297 0.565603 0)
(0.5297 0.691052 0)
(0.5297 0.824662 0)
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<vector> 
53
(
(2.00726 0.0446355 3.40271e-18)
(2.09261 0.136208 -2.83039e-19)
(2.18352 0.233737 0)
(2.28035 0.337609 -2.8279e-19)
(2.38347 0.448238 -4.73712e-18)
(2.4933 0.566063 -2.82553e-19)
(2.61027 0.691551 0)
(2.73485 0.825201 2.82329e-19)
...
)
;
    }
    top
    {
        type            symmetryPlane;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
