NN_files/dummy_case_mesh_coordinates/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
3780
(
0.539857
0.56065
0.582682
0.606026
0.63076
0.656966
0.684733
0.714153
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 6(0.5297 0.5297 0.5297 0.5297 0.5297 0.5297);
    }
    outlet
    {
        type            calculated;
        value           uniform 18.3423;
    }
    hopper_outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0.539568
0.559774
0.581184
0.603867
0.627901
0.653366
0.680346
0.708932
...
)
;
    }
    Wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
129
(
0.5297
0.5297
0.5297
0.5297
0.5297
0.5297
0.5297
0.5297
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
53
(
2.00726
2.09261
2.18352
2.28035
2.38347
2.4933
2.61027
2.73485
...
)
;
    }
    top
    {
        type            symmetryPlane;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
