NN_files/dummy_case_mesh_coordinates/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
3780
(
0.0447523
0.0447673
0.0447821
0.0447965
0.0448107
0.0448245
0.044838
0.0448512
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 6(6.39045 6.43685 6.48498 6.53489 6.58665 6.64034);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 2(6.59267 6.64267);
    }
    hopper_outlet
    {
        type            calculated;
        value           uniform 0;
    }
    Wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
129
(
0.0443312
0.135877
0.233377
0.337218
0.447814
0.565603
0.691052
0.824662
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
53
(
0.0446355
0.136208
0.233737
0.337609
0.448238
0.566063
0.691551
0.825201
...
)
;
    }
    top
    {
        type            symmetryPlane;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
