NN_files/dummy_case_mesh_coordinates/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
3780
(
0
2.36858e-20
-7.4258e-19
2.05496e-18
1.25894e-18
5.38712e-19
7.23936e-19
-2.57974e-18
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    hopper_outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0
-7.09381e-20
-7.09105e-20
-9.18016e-19
-7.0857e-20
0
6.14261e-19
7.07809e-20
...
)
;
    }
    Wall
    {
        type            calculated;
        value           uniform 0;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
53
(
3.40271e-18
-2.83039e-19
0
-2.8279e-19
-4.73712e-18
-2.82553e-19
0
2.82329e-19
...
)
;
    }
    top
    {
        type            symmetryPlane;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
