NN_files/dummy_case_mesh_coordinates/0/alpha.sludge
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.sludge;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform #eval "3.685/1445";
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
    }
    hopper_outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
    }
    bottom
    {
        type            zeroGradient;
    }
    Wall
    {
        type            zeroGradient;
    }
    top
    {
        type            symmetryPlane;
    }

    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
