NN_files/dummy_case_mesh_coordinates/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default             none;

    div(rhoPhi,U)       Gauss upwind;
    // div(rhoPhi,U)       Gauss linearUpwind grad(U); 
    // I could make it upwind but I saw it was linearUpwind grad(U) in the GitHub case
    div(tauDm)          Gauss linear;
    "div\(phi,alpha.*\)" Gauss upwind;
    "div\(phirb,alpha.*\)" Gauss upwind;
    div(rhoPhi,k)       Gauss upwind;
    div(rhoPhi,epsilon) Gauss upwind;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 1;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 1;
}


// ************************************************************************* //
